{
  "0": [
    "Strong opposition to proposed federal employment rule",
    "This cluster contains a significant number of comments opposing the proposed Schedule F rule, emphasizing concerns about its impact on civil service and government employees."
  ],
  "0a": [
    "Opposition centered on democratic values and government power",
    "Comments in this cluster express strong opposition to the proposed rule, highlighting concerns about its implications for democracy and the power dynamics within government."
  ],
  "0b": [
    "Concerns about employee performance and federal governance",
    "This cluster reflects opposition focused on the potential negative effects of the proposed rule on employee performance and the integrity of federal governance."
  ],
  "0c": [
    "Strong opposition from civil service advocates",
    "Comments here overwhelmingly oppose the proposed rule, stressing the importance of maintaining the integrity of civil service and the role of federal employees."
  ],
  "0d": [
    "Absolute opposition to Schedule F",
    "This small cluster shows complete opposition to the proposed Schedule F rule, with all comments expressing strong disapproval."
  ],
  "1": [
    "Opposition from the scientific community regarding funding",
    "This cluster captures strong opposition from the scientific community, particularly regarding the implications of the proposed rule on federal research and grant funding."
  ],
  "1a": [
    "Complete opposition to scientific grantmaking changes",
    "Comments in this cluster express total opposition to changes in federal grantmaking processes, emphasizing the importance of maintaining scientific integrity."
  ],
  "1b": [
    "Concerns about NIH and political influence",
    "This cluster reflects opposition related to the National Institutes of Health, with comments expressing fears about political influence on scientific research and funding."
  ],
  "1c": [
    "Strong opposition to political interference in science",
    "Comments here show complete opposition to the proposed rule, emphasizing concerns about political interference in scientific research and funding."
  ],
  "1d": [
    "Opposition to policy changes affecting scientific research",
    "This cluster contains comments opposing the proposed rule, focusing on its potential negative impact on scientific research and federal policies."
  ],
  "1e": [
    "Concerns about the future of scientific research",
    "Comments in this cluster express opposition to the proposed rule, highlighting worries about the future of scientific research and the role of scientists."
  ],
  "2": [
    "Opposition to Schedule F's impact on civil service",
    "This cluster reflects strong opposition to the proposed Schedule F rule, with comments emphasizing its detrimental effects on civil service and federal employees."
  ],
  "3": [
    "Mixed opinions on civil service and proposed rule",
    "This cluster contains a mix of opinions regarding the proposed rule, with a majority opposing it while some comments express support or neutrality."
  ],
  "3a": [
    "Strong opposition from federal personnel management",
    "Comments in this cluster show overwhelming opposition to the proposed rule, particularly from those concerned about federal personnel management."
  ],
  "3b": [
    "Concerns about policy and career positions",
    "This cluster reflects opposition focused on the implications of the proposed rule for career positions and policy-making within federal service."
  ],
  "3c": [
    "Strong opposition to accountability in civil service",
    "Comments here overwhelmingly oppose the proposed rule, stressing the importance of accountability and performance in civil service."
  ],
  "3d": [
    "Mixed views on civil service career implications",
    "This cluster contains mixed opinions on the proposed rule, with a significant number of comments opposing it while some express support."
  ],
  "3e": [
    "Strong support for accountability in federal employment",
    "This cluster shows overwhelming support for maintaining accountability in federal employment, with comments advocating for the protection of civil service."
  ],
  "4": [
    "Strong opposition to political influence in civil service",
    "This cluster captures strong opposition to the proposed rule, with comments emphasizing the need to protect civil service from political influence."
  ],
  "4a": [
    "Concerns about merit-based employment under political pressure",
    "Comments in this cluster express opposition to the proposed rule, focusing on the importance of merit-based employment free from political pressure."
  ],
  "4b": [
    "Complete opposition to changes in public service",
    "This cluster reflects total opposition to the proposed rule, with all comments expressing disapproval of changes affecting public service."
  ],
  "4c": [
    "Concerns about partisan influence on federal employees",
    "Comments here express opposition to the proposed rule, highlighting fears of partisan influence on federal employees and governance."
  ],
  "4d": [
    "Absolute opposition to political appointees in civil service",
    "This cluster shows complete opposition to the proposed rule, with all comments opposing the influence of political appointees in civil service."
  ],
  "4e": [
    "Strong opposition to changes affecting civil service jobs",
    "Comments in this cluster express total opposition to the proposed rule, emphasizing the need to protect civil service jobs from political influence."
  ]
}