{
  "0": [
    "Strong opposition to proposed federal employment rule",
    "This cluster contains a significant number of comments opposing the proposed Schedule F rule, emphasizing concerns about its impact on civil service and political neutrality."
  ],
  "0a": [
    "High opposition to the proposed rule",
    "This sub-cluster reflects a strong opposition to the proposed federal employment rule, with comments focusing on the implications for civil service and government integrity."
  ],
  "0aa": [
    "Concerns about proposed changes to civil service",
    "Comments in this sub-cluster express opposition to the proposed changes, highlighting fears about the potential erosion of civil service protections."
  ],
  "0ab": [
    "Opposition from civil service employees",
    "This sub-cluster showcases a nearly unanimous opposition from civil service employees regarding the proposed rule, citing political motivations behind the changes."
  ],
  "0ac": [
    "Political concerns regarding the proposed rule",
    "Comments here reflect fears that the proposed rule could politicize federal employment, undermining the integrity of government service."
  ],
  "0ad": [
    "Strong opposition to political changes in employment",
    "This sub-cluster indicates a high level of opposition to the proposed changes, with comments emphasizing the need for non-partisan civil service."
  ],
  "0b": [
    "Opposition from federal employees",
    "This sub-cluster captures the voices of federal employees who are largely against the proposed rule, expressing concerns about its implications for their roles."
  ],
  "0ba": [
    "Concerns from federal employees about proposed changes",
    "Comments in this sub-cluster reflect a strong opposition from federal employees, emphasizing the potential negative impact on their work environment."
  ],
  "0bb": [
    "Opposition to the proposed rule from civil service",
    "This sub-cluster highlights significant opposition from civil service employees regarding the proposed changes, focusing on the risks to their positions."
  ],
  "0bc": [
    "General opposition from civil service employees",
    "Comments here reflect a broad opposition among civil service employees, voicing concerns about the proposed rule's implications for their roles."
  ],
  "0bd": [
    "Unanimous opposition to the proposed rule",
    "This sub-cluster shows a complete opposition to the proposed rule, with comments emphasizing the need for maintaining civil service integrity."
  ],
  "0c": [
    "Mixed opinions on the proposed rule",
    "This cluster contains a mix of opinions, with a majority opposing the proposed rule while some comments express support or neutrality."
  ],
  "0ca": [
    "Strong opposition from civil service workers",
    "Comments in this sub-cluster reflect a strong opposition from civil service workers, emphasizing the need for protections against political influence."
  ],
  "0cb": [
    "Concerns about political influence in federal positions",
    "This sub-cluster highlights concerns about the potential for political influence in federal employment, with a strong opposition to the proposed rule."
  ],
  "0cc": [
    "Unanimous opposition based on loyalty concerns",
    "This sub-cluster shows complete opposition based on concerns about loyalty and the integrity of civil service."
  ],
  "0cd": [
    "Support for accountability in federal employment",
    "This sub-cluster contains comments supporting accountability measures for federal employees, contrasting with the overall opposition."
  ],
  "0d": [
    "High opposition to proposed civil service changes",
    "This sub-cluster reflects a strong opposition to the proposed changes in civil service, with comments emphasizing the need for protections."
  ],
  "0da": [
    "Concerns about proposed civil service changes",
    "Comments here express strong opposition to the proposed changes, highlighting fears about the erosion of civil service protections."
  ],
  "0db": [
    "Near unanimous opposition to proposed rule",
    "This sub-cluster shows near unanimous opposition to the proposed rule, with comments emphasizing the need for non-partisan civil service."
  ],
  "0dc": [
    "Complete opposition from civil service employees",
    "This sub-cluster reflects complete opposition from civil service employees regarding the proposed changes, emphasizing the need for integrity."
  ],
  "0dd": [
    "Strong opposition to proposed changes in civil service",
    "Comments in this sub-cluster reflect a strong opposition to the proposed changes, emphasizing the need for protections against political influence."
  ],
  "0e": [
    "High opposition to proposed civil service rule",
    "This sub-cluster captures a high level of opposition to the proposed civil service rule, with comments emphasizing the need for integrity."
  ],
  "0ea": [
    "Concerns about political influence in civil service",
    "Comments here reflect strong opposition to the proposed rule, highlighting fears about political influence in civil service."
  ],
  "0eb": [
    "Opposition to proposed changes in civil service",
    "This sub-cluster showcases opposition to the proposed changes, emphasizing the need for protections for civil service employees."
  ],
  "0ec": [
    "Complete opposition based on appointee concerns",
    "This sub-cluster shows complete opposition based on concerns about appointees and their impact on civil service integrity."
  ],
  "0ed": [
    "High opposition to merit-based changes",
    "Comments in this sub-cluster reflect strong opposition to changes that could undermine merit-based hiring in civil service."
  ],
  "0ee": [
    "Complete opposition to proposed changes in positions",
    "This sub-cluster reflects complete opposition to proposed changes in civil service positions, emphasizing the need for integrity."
  ],
  "1": [
    "Strong opposition to proposed changes in scientific integrity",
    "This cluster contains comments opposing the proposed changes, emphasizing concerns about the impact on scientific integrity and research funding."
  ],
  "1a": [
    "High opposition from scientific community",
    "This sub-cluster reflects strong opposition from the scientific community regarding the proposed changes, focusing on the implications for research integrity."
  ],
  "1aa": [
    "Concerns about integrity in scientific grants",
    "Comments in this sub-cluster express strong opposition to the proposed changes, highlighting fears about the integrity of scientific grants."
  ],
  "1ab": [
    "Complete opposition to proposed grant changes",
    "This sub-cluster shows complete opposition to proposed changes affecting scientific grants, emphasizing the need for integrity."
  ],
  "1ac": [
    "Concerns about political influence in scientific research",
    "Comments here reflect strong opposition to the proposed rule, highlighting fears about political influence in scientific research."
  ],
  "1ad": [
    "Opposition to political appointees in science",
    "This sub-cluster showcases opposition to the proposed rule, emphasizing concerns about political appointees in scientific positions."
  ],
  "1ae": [
    "Concerns about political influence in scientific positions",
    "Comments in this sub-cluster reflect strong opposition to the proposed changes, emphasizing the need for integrity in scientific positions."
  ],
  "1b": [
    "High opposition to proposed changes in scientific positions",
    "This sub-cluster captures a high level of opposition to the proposed changes in scientific positions, emphasizing the need for integrity."
  ],
  "1ba": [
    "Concerns about political influence in scientific service",
    "Comments here reflect strong opposition to the proposed rule, highlighting fears about political influence in scientific service."
  ],
  "1bb": [
    "Strong opposition to proposed changes in scientific positions",
    "This sub-cluster showcases strong opposition to proposed changes affecting scientific positions, emphasizing the need for integrity."
  ],
  "1bc": [
    "Concerns about funding and policymaking in science",
    "Comments in this sub-cluster reflect strong opposition to proposed changes affecting funding and policymaking in scientific research."
  ],
  "1bd": [
    "High opposition to proposed changes in scientific research",
    "This sub-cluster reflects high opposition to proposed changes in scientific research, emphasizing the need for integrity."
  ],
  "1c": [
    "Strong opposition to proposed changes in NIH funding",
    "This cluster contains comments opposing the proposed changes, emphasizing concerns about the impact on NIH funding and research integrity."
  ],
  "1d": [
    "Concerns about political appointees in NIH",
    "Comments in this sub-cluster reflect strong opposition to the proposed changes, highlighting fears about political appointees in NIH positions."
  ],
  "2": [
    "High opposition to proposed Schedule F rule",
    "This cluster reflects a strong opposition to the proposed Schedule F rule, with comments emphasizing concerns about its impact on civil service."
  ],
  "3": [
    "Significant opposition to proposed civil service rule",
    "This cluster contains a significant number of comments opposing the proposed civil service rule, emphasizing concerns about its implications for federal employees."
  ],
  "3a": [
    "Concerns about policy changes in civil service",
    "This sub-cluster reflects opposition to proposed policy changes in civil service, with comments emphasizing the need for protections."
  ],
  "3b": [
    "High opposition to proposed changes in personnel management",
    "Comments in this sub-cluster reflect strong opposition to proposed changes in personnel management, emphasizing the need for integrity."
  ],
  "3c": [
    "Concerns about political influence in federal personnel",
    "This sub-cluster showcases concerns about political influence in federal personnel decisions, with a strong opposition to the proposed rule."
  ],
  "3ca": [
    "High opposition to proposed personnel management changes",
    "Comments here reflect strong opposition to proposed changes in personnel management, emphasizing the need for integrity."
  ],
  "3cb": [
    "Concerns about political influence in federal service",
    "This sub-cluster highlights concerns about political influence in federal service, with a strong opposition to the proposed rule."
  ],
  "3cc": [
    "High opposition to proposed changes in federal personnel",
    "Comments in this sub-cluster reflect strong opposition to proposed changes in federal personnel, emphasizing the need for integrity."
  ],
  "3cd": [
    "Concerns about political influence in civil service",
    "This sub-cluster showcases concerns about political influence in civil service, with a strong opposition to the proposed rule."
  ],
  "3ce": [
    "Mixed opinions on proposed rule comments",
    "This sub-cluster contains mixed opinions on the proposed rule, with some comments expressing support or neutrality."
  ],
  "3d": [
    "Near unanimous opposition to proposed civil service rule",
    "This sub-cluster reflects near unanimous opposition to the proposed civil service rule, emphasizing the need for integrity."
  ],
  "3e": [
    "High opposition to proposed changes in statistical positions",
    "Comments in this sub-cluster reflect strong opposition to proposed changes in statistical positions, emphasizing the need for integrity."
  ]
}