{
  "0": [
    "Strong opposition to Schedule F",
    "This cluster contains a significant number of comments opposing the proposed Schedule F rule, emphasizing concerns about civil service integrity and the political implications for federal employees."
  ],
  "0a": [
    "Opposition centered on civil service and political integrity",
    "Comments in this cluster express strong disapproval of the proposed rule, focusing on the importance of maintaining a nonpartisan civil service and the potential risks to government employees."
  ],
  "0aa": [
    "Concerns about civil service and employee rights",
    "This cluster highlights fears regarding the erosion of civil service protections and the implications for federal employees under the proposed rule."
  ],
  "0ab": [
    "Political implications of Schedule F",
    "Comments here reflect a strong opposition to the political motivations behind the proposed rule, emphasizing the need for a neutral civil service."
  ],
  "0ac": [
    "Opposition to political appointees in civil service",
    "This cluster expresses concerns about the impact of political appointees on the integrity of federal positions and the potential for partisan influence."
  ],
  "0ad": [
    "Absolute opposition to Schedule F",
    "Comments in this cluster unanimously oppose the proposed rule, highlighting the perceived threats to civil service and government accountability."
  ],
  "0b": [
    "Concerns about federal employee treatment",
    "This cluster reflects strong opposition to the proposed rule, focusing on the treatment and rights of federal employees in the context of political changes."
  ],
  "0ba": [
    "Opposition to performance-based evaluations",
    "Comments here express concerns about the implications of performance evaluations for federal employees under the proposed rule."
  ],
  "0bb": [
    "Political concerns regarding federal employment",
    "This cluster highlights fears about the political implications of the proposed rule on federal employment and governance."
  ],
  "0bc": [
    "Opposition to proposed changes in federal employment",
    "Comments in this cluster express strong disapproval of the proposed changes to federal employment policies and their potential impact."
  ],
  "0bd": [
    "Near-unanimous opposition to the rule",
    "This cluster shows overwhelming opposition to the proposed rule, with comments emphasizing the need for civil service protections."
  ],
  "0be": [
    "Concerns about regulatory changes",
    "Comments here reflect opposition to the proposed regulatory changes and their potential impact on civil service and employee rights."
  ],
  "0c": [
    "General opposition to Schedule F",
    "This cluster contains comments that broadly oppose the proposed Schedule F rule, emphasizing the need for accountability in government."
  ],
  "0ca": [
    "Opposition to proposed government changes",
    "Comments in this cluster express disapproval of the proposed changes to government employment policies and their implications."
  ],
  "0cb": [
    "Political concerns about federal governance",
    "This cluster reflects fears about the political implications of the proposed rule on federal governance and public service."
  ],
  "0cc": [
    "Absolute opposition to civil service changes",
    "Comments here show unanimous opposition to the proposed changes affecting civil service, emphasizing the need for protections."
  ],
  "0cd": [
    "Concerns about presidential influence",
    "This cluster highlights fears regarding the potential for increased presidential influence over federal employees under the proposed rule."
  ],
  "0ce": [
    "Mixed sentiments with some opposition",
    "Comments in this cluster show a mix of sentiments, with a significant portion expressing opposition to the proposed rule."
  ],
  "0d": [
    "Strong opposition to civil service changes",
    "This cluster reflects a strong opposition to the proposed changes affecting civil service, emphasizing the need for accountability and integrity."
  ],
  "0da": [
    "Concerns about merit-based systems",
    "Comments here express fears about the implications of merit-based systems under the proposed rule for federal employees."
  ],
  "0db": [
    "Near-unanimous opposition to civil service changes",
    "This cluster shows overwhelming opposition to the proposed changes affecting civil service, emphasizing the need for protections."
  ],
  "0dc": [
    "Concerns about political influence in civil service",
    "Comments in this cluster express fears about the potential for political influence over civil service positions under the proposed rule."
  ],
  "0dd": [
    "Strong opposition to proposed changes",
    "This cluster reflects strong opposition to the proposed changes affecting civil service, emphasizing the need for accountability and integrity."
  ],
  "0de": [
    "Concerns about performance evaluations",
    "Comments here express concerns about the implications of performance evaluations for federal employees under the proposed rule."
  ],
  "0e": [
    "General opposition to Schedule F",
    "This cluster contains comments that broadly oppose the proposed Schedule F rule, emphasizing the need for accountability in government."
  ],
  "0ea": [
    "Concerns about federal employee treatment",
    "Comments in this cluster reflect strong opposition to the proposed rule, focusing on the treatment and rights of federal employees."
  ],
  "0eb": [
    "Political concerns regarding federal employment",
    "This cluster highlights fears about the political implications of the proposed rule on federal employment and governance."
  ],
  "0ec": [
    "Absolute opposition to civil service changes",
    "Comments here show unanimous opposition to the proposed changes affecting civil service, emphasizing the need for protections."
  ],
  "0ed": [
    "Concerns about loyalty tests",
    "This cluster reflects fears regarding the introduction of loyalty tests for federal employees under the proposed rule."
  ],
  "1": [
    "Strong opposition to scientific integrity and research concerns",
    "This cluster represents opposition from the scientific community, with comments highlighting concerns about the impact on federal research and grant processes."
  ],
  "1a": [
    "Concerns about scientific integrity in research",
    "Comments in this cluster express strong disapproval of the proposed rule, focusing on the importance of maintaining scientific integrity in federal research."
  ],
  "1aa": [
    "Opposition to political appointees in scientific roles",
    "This cluster highlights fears regarding the impact of political appointees on scientific research and integrity."
  ],
  "1ab": [
    "Absolute opposition to political influence in science",
    "Comments here show unanimous opposition to the proposed rule, emphasizing the need for scientific independence."
  ],
  "1ac": [
    "Concerns about research policy changes",
    "This cluster reflects fears about the implications of proposed changes to research policies under the new rule."
  ],
  "1ad": [
    "Strong opposition to proposed research changes",
    "Comments in this cluster express strong disapproval of the proposed changes affecting scientific research and integrity."
  ],
  "1ae": [
    "Concerns about funding integrity",
    "This cluster highlights fears regarding the integrity of funding processes under the proposed rule."
  ],
  "1b": [
    "Opposition to Schedule F's impact on science",
    "Comments here express concerns about the implications of Schedule F on scientific research and integrity."
  ],
  "1c": [
    "Concerns about political influence in NIH",
    "This cluster reflects fears about the potential for political influence over NIH appointments and research integrity."
  ],
  "1d": [
    "Strong opposition to funding interference",
    "Comments in this cluster express strong disapproval of the proposed rule, emphasizing the need for integrity in funding processes."
  ],
  "1da": [
    "Absolute opposition to funding integrity concerns",
    "This cluster shows unanimous opposition to the proposed rule, emphasizing the need for integrity in scientific funding."
  ],
  "1db": [
    "Concerns about political interference in grants",
    "Comments here reflect fears regarding the potential for political interference in grant processes under the proposed rule."
  ],
  "1dc": [
    "Strong opposition to integrity concerns",
    "This cluster highlights fears regarding the integrity of scientific research and funding under the proposed rule."
  ],
  "1dd": [
    "Absolute opposition to discretionary funding changes",
    "Comments in this cluster show unanimous opposition to the proposed changes affecting discretionary funding in scientific research."
  ],
  "1de": [
    "Concerns about integrity in scientific funding",
    "This cluster reflects fears regarding the integrity of scientific funding processes under the proposed rule."
  ],
  "1e": [
    "Strong opposition to Schedule F's impact on science",
    "This cluster contains comments that broadly oppose the proposed Schedule F rule, emphasizing the need for integrity in scientific research."
  ],
  "2": [
    "Mixed opposition to civil service changes",
    "This cluster contains a mix of comments opposing the proposed changes to civil service, with some expressing support for reform."
  ],
  "2a": [
    "Concerns about performance and accountability",
    "Comments in this cluster express mixed feelings about the proposed changes, focusing on performance and accountability in civil service."
  ],
  "2b": [
    "Opposition to proposed civil service policies",
    "This cluster reflects strong opposition to the proposed civil service policies, emphasizing the need for protections for employees."
  ],
  "2c": [
    "Concerns about federal employment policies",
    "Comments here express fears regarding the implications of proposed changes to federal employment policies."
  ],
  "2ca": [
    "Mixed sentiments on civil service changes",
    "This cluster contains comments that reflect mixed sentiments about the proposed changes to civil service, with some expressing support for reform."
  ],
  "2cb": [
    "Strong opposition to political influence in civil service",
    "Comments in this cluster express strong disapproval of the proposed changes affecting civil service and the potential for political influence."
  ],
  "2cc": [
    "Concerns about statistical improvements",
    "This cluster reflects fears regarding the implications of proposed statistical improvements for civil service and employment."
  ],
  "2cd": [
    "Opposition to political influence in civil service",
    "Comments here express strong disapproval of the proposed changes affecting civil service and the potential for political influence."
  ],
  "2ce": [
    "Concerns about career positions and policies",
    "This cluster highlights fears regarding the implications of proposed changes to career positions and policies in civil service."
  ],
  "2d": [
    "Strong opposition to proposed changes",
    "This cluster reflects strong opposition to the proposed changes affecting civil service, emphasizing the need for accountability and integrity."
  ],
  "2da": [
    "Concerns about federal worker treatment",
    "Comments in this cluster express strong opposition to the proposed changes affecting federal workers and their rights."
  ],
  "2db": [
    "Near-unanimous opposition to civil service changes",
    "This cluster shows overwhelming opposition to the proposed changes affecting civil service, emphasizing the need for protections."
  ],
  "2dc": [
    "Concerns about OPM's role in civil service",
    "Comments here reflect fears regarding the role of OPM in implementing proposed changes to civil service."
  ],
  "2dd": [
    "Concerns about personnel management changes",
    "This cluster reflects fears regarding the implications of proposed changes to personnel management in civil service."
  ],
  "2e": [
    "Strong opposition to Schedule F's impact on civil service",
    "This cluster contains comments that broadly oppose the proposed Schedule F rule, emphasizing the need for accountability in civil service."
  ],
  "3": [
    "Strong opposition to Schedule F",
    "This cluster contains a significant number of comments opposing the proposed Schedule F rule, emphasizing concerns about civil service integrity and the political implications for federal employees."
  ]
}