{
  "0": [
    "Strong opposition to proposed federal employment rule",
    "This cluster contains a significant number of comments opposing the proposed Schedule F rule, emphasizing concerns about its impact on civil service and federal employees."
  ],
  "0a": [
    "Complete opposition from specific government positions",
    "This sub-cluster reflects unanimous opposition from comments discussing the implications of the proposed rule on specific government positions and management."
  ],
  "0b": [
    "High opposition regarding civil service and federal employees",
    "This sub-cluster highlights strong opposition to the proposed rule, particularly from comments focused on civil service and the role of federal employees."
  ],
  "0c": [
    "Concerns about policy impact on civil service careers",
    "This sub-cluster features comments that express opposition based on the potential negative effects of the proposed rule on civil service careers and policies."
  ],
  "0d": [
    "Opposition related to health and public service",
    "This sub-cluster includes comments opposing the proposed rule, particularly in relation to its implications for health and public service employees."
  ],
  "0e": [
    "Scientific community's opposition to political influence",
    "This sub-cluster showcases strong opposition from the scientific community regarding the proposed rule, emphasizing concerns about political influence on research and science."
  ],
  "1": [
    "General opposition to federal employment rule",
    "This cluster captures a broad range of comments opposing the proposed federal employment rule, with a focus on its implications for civil service and government employees."
  ],
  "1a": [
    "Concerns about employee performance evaluations",
    "This sub-cluster reflects opposition centered on the proposed rule's impact on employee performance evaluations and management practices."
  ],
  "1b": [
    "Opposition from civil servants regarding political influence",
    "This sub-cluster highlights strong opposition from civil servants concerned about the political implications of the proposed rule."
  ],
  "1c": [
    "Unanimous opposition from federal workers",
    "This sub-cluster contains comments that express complete opposition to the proposed rule from federal workers, emphasizing their concerns about its impact."
  ],
  "1d": [
    "Opposition based on democratic principles",
    "This sub-cluster features comments opposing the proposed rule, focusing on its implications for democracy and government accountability."
  ],
  "1e": [
    "Strong opposition from civil servants",
    "This sub-cluster showcases overwhelming opposition from civil servants regarding the proposed rule and its potential effects on their roles."
  ],
  "2": [
    "Opposition focused on Schedule F implications",
    "This cluster contains comments that express strong opposition to the proposed Schedule F rule, particularly regarding its impact on civil service and government employees."
  ],
  "3": [
    "Opposition from scientific community on research funding",
    "This cluster reflects significant opposition from the scientific community, with comments highlighting concerns about the proposed rule's impact on federal research and funding."
  ],
  "3a": [
    "Complete opposition from scientific researchers",
    "This sub-cluster features unanimous opposition from scientific researchers regarding the proposed rule and its implications for research integrity."
  ],
  "3b": [
    "Concerns about political influence on NIH and research",
    "This sub-cluster highlights strong opposition from comments discussing the potential political influence on NIH and federal research positions."
  ],
  "3c": [
    "Opposition focused on research integrity and funding",
    "This sub-cluster contains comments opposing the proposed rule, emphasizing concerns about maintaining integrity in scientific research and funding."
  ],
  "3d": [
    "Unanimous opposition from scientists on policy implications",
    "This sub-cluster reflects complete opposition from scientists regarding the proposed rule, focusing on its implications for scientific policy and research."
  ],
  "4": [
    "General opposition to political influence in civil service",
    "This cluster captures a wide range of comments opposing the proposed rule, particularly regarding its implications for civil service and political influence."
  ],
  "4a": [
    "Opposition from civil servants regarding political administration",
    "This sub-cluster features strong opposition from civil servants concerned about the political implications of the proposed rule under the current administration."
  ],
  "4b": [
    "Complete opposition to partisan influence in civil service",
    "This sub-cluster reflects unanimous opposition to the proposed rule, emphasizing the need to protect nonpartisan civil service from political influence."
  ],
  "4c": [
    "Concerns about trust in government appointees",
    "This sub-cluster highlights strong opposition regarding the proposed rule's impact on trust in government appointees and civil service integrity."
  ],
  "4d": [
    "Unanimous opposition based on constitutional loyalty",
    "This sub-cluster contains comments opposing the proposed rule, emphasizing the importance of loyalty to the constitution in public service."
  ],
  "4e": [
    "Opposition to changes in civil service positions",
    "This sub-cluster reflects complete opposition to the proposed rule, focusing on concerns about changes to civil service positions and policies."
  ]
}