{
  "0": [
    "Strong opposition to proposed federal employment rule",
    "This cluster contains a significant number of comments opposing the proposed Schedule F rule, emphasizing concerns about its impact on federal employees and civil service integrity."
  ],
  "0a": [
    "Criticism of government power and political influence",
    "Comments in this sub-cluster express strong opposition to the proposed rule, focusing on the perceived political motivations behind the changes and their implications for government integrity."
  ],
  "0aa": [
    "Concerns about political power and governance",
    "This sub-cluster highlights fears regarding the political implications of the proposed rule, with many comments stressing the need for a non-partisan civil service."
  ],
  "0ab": [
    "Negative views on proposed changes and their effects",
    "Comments here reflect a strong disapproval of the proposed changes, labeling them as detrimental and expressing a desire for maintaining current civil service standards."
  ],
  "0ac": [
    "Opposition to Trump's administration policies",
    "This sub-cluster features comments that specifically criticize the influence of the Trump administration on the proposed rule, linking it to broader concerns about democracy."
  ],
  "0ad": [
    "Opposition to changes in civil service rules",
    "Comments in this sub-cluster express strong disapproval of the proposed changes to civil service rules, emphasizing the need to protect the integrity of government employment."
  ],
  "0ae": [
    "Strong objections to the proposed rule",
    "This sub-cluster contains comments that strongly oppose the proposed rule, with many expressing a desire to maintain the current structure of civil service."
  ],
  "0b": [
    "High opposition to civil service changes",
    "This cluster shows overwhelming opposition to the proposed changes affecting federal civil service, with a focus on the implications for government employees."
  ],
  "0ba": [
    "Concerns about federal civil service integrity",
    "Comments in this sub-cluster express strong opposition to the proposed rule, emphasizing the importance of maintaining integrity within the federal civil service."
  ],
  "0bb": [
    "Opposition to political changes in federal employment",
    "This sub-cluster reflects concerns about the political implications of the proposed rule, with many comments emphasizing the need for a non-partisan civil service."
  ],
  "0bc": [
    "Complete opposition to civil service changes",
    "This sub-cluster contains comments that express total opposition to the proposed changes, highlighting the importance of protecting civil service integrity."
  ],
  "0bd": [
    "Strong opposition to proposed civil service rule",
    "Comments here reflect a strong disapproval of the proposed rule, emphasizing the need to protect the integrity of civil service."
  ],
  "0c": [
    "Concerns about federal employee treatment",
    "This sub-cluster features comments that express concerns about the treatment of federal employees under the proposed rule, emphasizing the need for fair policies."
  ],
  "0ca": [
    "Opposition to changes affecting federal employees",
    "Comments in this sub-cluster express strong opposition to the proposed changes, focusing on their potential negative impact on federal employees."
  ],
  "0cb": [
    "Concerns about political influence on federal employment",
    "This sub-cluster highlights fears regarding the political implications of the proposed rule, with many comments stressing the need for a non-partisan civil service."
  ],
  "0cc": [
    "Concerns about employee performance under new rules",
    "Comments here reflect concerns about how the proposed rule may negatively affect employee performance evaluations and job security."
  ],
  "0cd": [
    "Opposition to federal employee management changes",
    "This sub-cluster contains comments that express strong disapproval of the proposed changes to federal employee management, emphasizing the need for fair treatment."
  ],
  "0ce": [
    "Complete opposition to proposed changes",
    "This sub-cluster contains comments that express total opposition to the proposed changes, highlighting the importance of protecting civil service integrity."
  ],
  "0d": [
    "High opposition to civil service changes",
    "This cluster shows overwhelming opposition to the proposed changes affecting federal civil service, with a focus on the implications for government employees."
  ],
  "0da": [
    "Strong opposition to proposed civil service rule",
    "Comments in this sub-cluster express strong disapproval of the proposed changes to civil service rules, emphasizing the need to protect the integrity of government employment."
  ],
  "0db": [
    "Complete opposition to proposed civil service changes",
    "This sub-cluster contains comments that express total opposition to the proposed changes, highlighting the importance of protecting civil service integrity."
  ],
  "0dc": [
    "Concerns about federal employee treatment",
    "This sub-cluster features comments that express concerns about the treatment of federal employees under the proposed rule, emphasizing the need for fair policies."
  ],
  "0dd": [
    "Opposition to politicization of civil service",
    "Comments here reflect concerns about the potential politicization of civil service under the proposed rule, emphasizing the need for a non-partisan approach."
  ],
  "0de": [
    "Strong opposition to Schedule F changes",
    "This sub-cluster contains comments that strongly oppose the proposed changes under Schedule F, emphasizing the need to maintain a non-partisan civil service."
  ],
  "1": [
    "Opposition focused on scientific integrity and research concerns",
    "This cluster represents opposition from the scientific community, with comments highlighting concerns about the impact on federal research and grant processes."
  ],
  "1a": [
    "Concerns about political influence in scientific research",
    "Comments in this sub-cluster express strong opposition to the proposed rule, focusing on the perceived political motivations behind changes to scientific positions."
  ],
  "1aa": [
    "Opposition to political interference in science",
    "This sub-cluster highlights fears regarding the political implications of the proposed rule, with many comments stressing the need for scientific integrity."
  ],
  "1ab": [
    "Complete opposition to political appointees in science",
    "Comments here reflect a strong disapproval of the proposed changes, emphasizing the need for scientific independence from political influence."
  ],
  "1ac": [
    "Concerns about funding and research integrity",
    "This sub-cluster features comments that express concerns about the potential impact of the proposed rule on research funding and integrity."
  ],
  "1ad": [
    "Strong opposition to political appointees in research",
    "Comments in this sub-cluster express strong opposition to the proposed rule, emphasizing the need for scientific independence from political influence."
  ],
  "1ae": [
    "Concerns about political influence on scientific policy",
    "This sub-cluster highlights fears regarding the political implications of the proposed rule, with many comments stressing the need for a non-partisan approach to science."
  ],
  "1b": [
    "Opposition to political changes in scientific positions",
    "This cluster shows overwhelming opposition to the proposed changes affecting scientific positions, with a focus on the implications for research integrity."
  ],
  "1c": [
    "Complete opposition to political influence in scientific research",
    "This sub-cluster contains comments that express total opposition to the proposed changes, highlighting the importance of maintaining scientific integrity."
  ],
  "1d": [
    "High opposition to political appointees in science",
    "This cluster shows overwhelming opposition to the proposed changes affecting political appointees in scientific positions, emphasizing the need for integrity."
  ],
  "1da": [
    "Concerns about political influence in scientific research",
    "Comments in this sub-cluster express strong opposition to the proposed rule, focusing on the perceived political motivations behind changes to scientific positions."
  ],
  "1db": [
    "Complete opposition to political appointees in science",
    "This sub-cluster contains comments that express total opposition to the proposed changes, highlighting the importance of maintaining scientific integrity."
  ],
  "1dc": [
    "Concerns about political influence on scientific policy",
    "This sub-cluster highlights fears regarding the political implications of the proposed rule, with many comments stressing the need for a non-partisan approach to science."
  ],
  "1dd": [
    "Concerns about grantmaking and political influence",
    "Comments here reflect concerns about the potential impact of the proposed rule on grantmaking processes and the integrity of scientific research."
  ],
  "1de": [
    "Strong opposition to political influence in grantmaking",
    "This sub-cluster contains comments that strongly oppose the proposed changes to grantmaking processes, emphasizing the need for scientific independence."
  ],
  "1e": [
    "Opposition to political interference in scientific integrity",
    "This cluster represents strong opposition to the proposed rule, with comments highlighting concerns about the impact on scientific integrity and research funding."
  ],
  "2": [
    "Strong opposition to Schedule F and civil service changes",
    "This cluster contains a significant number of comments opposing the proposed Schedule F rule, emphasizing concerns about its impact on federal employees and civil service integrity."
  ],
  "3": [
    "Mixed opinions on civil service changes",
    "This cluster reflects a mix of opinions regarding the proposed changes to civil service, with a notable portion of comments expressing opposition."
  ],
  "3a": [
    "Concerns about accountability in civil service",
    "Comments in this sub-cluster express concerns about the accountability of civil service under the proposed rule, emphasizing the need for transparency."
  ],
  "3aa": [
    "Mixed opinions on proposed civil service rule",
    "This sub-cluster features comments that reflect a mix of opinions on the proposed rule, with some expressing support and others voicing concerns."
  ],
  "3ab": [
    "Concerns about civil service policy changes",
    "Comments here reflect concerns about the potential impact of the proposed changes on civil service policies and employee rights."
  ],
  "3ac": [
    "Strong opposition to proposed civil service changes",
    "This sub-cluster contains comments that express strong disapproval of the proposed changes, emphasizing the need to protect civil service integrity."
  ],
  "3ad": [
    "Concerns about personnel management under new rules",
    "Comments in this sub-cluster express concerns about how the proposed rule may negatively affect personnel management and employee rights."
  ],
  "3ae": [
    "Concerns about statistical integrity in civil service",
    "This sub-cluster highlights fears regarding the potential impact of the proposed rule on statistical integrity within civil service."
  ],
  "3b": [
    "Mixed opinions on civil service policy changes",
    "This cluster reflects a mix of opinions regarding the proposed changes to civil service policies, with some comments expressing support and others voicing concerns."
  ],
  "3c": [
    "Strong opposition to proposed civil service changes",
    "This sub-cluster contains comments that express strong disapproval of the proposed changes, emphasizing the need to protect civil service integrity."
  ],
  "3ca": [
    "Concerns about federal employee management changes",
    "Comments here reflect concerns about the potential impact of the proposed changes on federal employee management and rights."
  ],
  "3cb": [
    "Concerns about political influence on civil service",
    "This sub-cluster highlights fears regarding the political implications of the proposed rule, with many comments stressing the need for a non-partisan civil service."
  ],
  "3cc": [
    "Complete opposition to proposed civil service changes",
    "This sub-cluster contains comments that express total opposition to the proposed changes, highlighting the importance of protecting civil service integrity."
  ],
  "3cd": [
    "Concerns about federal employee treatment",
    "This sub-cluster features comments that express concerns about the treatment of federal employees under the proposed rule, emphasizing the need for fair policies."
  ],
  "3d": [
    "Complete opposition to proposed civil service changes",
    "This sub-cluster contains comments that express total opposition to the proposed changes, highlighting the importance of protecting civil service integrity."
  ],
  "3e": [
    "Strong support for accountability in civil service",
    "This cluster contains comments that express strong support for accountability measures in civil service, emphasizing the need for transparency and integrity."
  ],
  "4": [
    "Strong opposition to proposed civil service changes",
    "This cluster contains a significant number of comments opposing the proposed changes to civil service, emphasizing concerns about its impact on federal employees."
  ],
  "4a": [
    "Concerns about political influence in civil service",
    "Comments in this sub-cluster express strong opposition to the proposed rule, focusing on the perceived political motivations behind changes to civil service."
  ],
  "4aa": [
    "Opposition to political interference in civil service",
    "This sub-cluster highlights fears regarding the political implications of the proposed rule, with many comments stressing the need for a non-partisan civil service."
  ],
  "4ab": [
    "Complete opposition to political appointees in civil service",
    "Comments here reflect a strong disapproval of the proposed changes, emphasizing the need for civil service independence from political influence."
  ],
  "4ac": [
    "Concerns about loyalty and qualifications in civil service",
    "This sub-cluster features comments that express concerns about the potential impact of the proposed rule on loyalty and qualifications in civil service."
  ],
  "4ad": [
    "Strong opposition to political appointees in civil service",
    "Comments in this sub-cluster express strong opposition to the proposed rule, emphasizing the need for civil service independence from political influence."
  ],
  "4ae": [
    "Concerns about political influence on civil service performance",
    "This sub-cluster highlights fears regarding the political implications of the proposed rule, with many comments stressing the need for a non-partisan approach to civil service."
  ],
  "4b": [
    "High opposition to civil service changes",
    "This cluster shows overwhelming opposition to the proposed changes affecting civil service, with a focus on the implications for government employees."
  ],
  "4ba": [
    "Concerns about civil service integrity",
    "Comments in this sub-cluster express strong opposition to the proposed rule, emphasizing the importance of maintaining integrity within civil service."
  ],
  "4bb": [
    "Opposition to political changes in civil service",
    "This sub-cluster reflects concerns about the political implications of the proposed rule, with many comments emphasizing the need for a non-partisan civil service."
  ],
  "4bc": [
    "Complete opposition to proposed civil service changes",
    "This sub-cluster contains comments that express total opposition to the proposed changes, highlighting the importance of protecting civil service integrity."
  ],
  "4bd": [
    "Strong opposition to proposed civil service changes",
    "Comments here reflect a strong disapproval of the proposed changes, emphasizing the need to protect the integrity of civil service."
  ],
  "4be": [
    "Concerns about loyalty and qualifications in civil service",
    "This sub-cluster features comments that express concerns about the potential impact of the proposed rule on loyalty and qualifications in civil service."
  ],
  "4c": [
    "Strong opposition to proposed civil service changes",
    "This cluster contains a significant number of comments opposing the proposed changes to civil service, emphasizing concerns about its impact on federal employees."
  ],
  "4ca": [
    "Complete opposition to proposed civil service changes",
    "This sub-cluster contains comments that express total opposition to the proposed changes, highlighting the importance of protecting civil service integrity."
  ],
  "4cb": [
    "Concerns about political influence on civil service",
    "This sub-cluster highlights fears regarding the political implications of the proposed rule, with many comments stressing the need for a non-partisan civil service."
  ],
  "4cc": [
    "Complete opposition to proposed civil service changes",
    "This sub-cluster contains comments that express total opposition to the proposed changes, highlighting the importance of protecting civil service integrity."
  ],
  "4cd": [
    "Strong opposition to proposed civil service changes",
    "Comments here reflect a strong disapproval of the proposed changes, emphasizing the need to protect the integrity of civil service."
  ],
  "4ce": [
    "Concerns about political influence on civil service performance",
    "This sub-cluster highlights fears regarding the political implications of the proposed rule, with many comments stressing the need for a non-partisan approach to civil service."
  ],
  "4d": [
    "Complete opposition to proposed civil service changes",
    "This sub-cluster contains comments that express total opposition to the proposed changes, highlighting the importance of protecting civil service integrity."
  ],
  "4e": [
    "Strong opposition to loyalty tests for civil servants",
    "This cluster contains comments that express strong opposition to the proposed loyalty tests for civil servants, emphasizing the need for a non-partisan civil service."
  ],
  "4ea": [
    "Complete opposition to loyalty tests for civil servants",
    "This sub-cluster contains comments that express total opposition to the proposed loyalty tests, highlighting the importance of maintaining a non-partisan civil service."
  ],
  "4eb": [
    "Concerns about loyalty and qualifications in civil service",
    "This sub-cluster features comments that express concerns about the potential impact of the proposed rule on loyalty and qualifications in civil service."
  ],
  "4ec": [
    "Complete opposition to loyalty tests for civil servants",
    "This sub-cluster contains comments that express total opposition to the proposed loyalty tests, highlighting the importance of maintaining a non-partisan civil service."
  ],
  "4ed": [
    "Concerns about loyalty and qualifications in civil service",
    "This sub-cluster features comments that express concerns about the potential impact of the proposed rule on loyalty and qualifications in civil service."
  ],
  "4ee": [
    "Complete opposition to loyalty tests for civil servants",
    "This sub-cluster contains comments that express total opposition to the proposed loyalty tests, highlighting the importance of maintaining a non-partisan civil service."
  ]
}